#include "change_profile.h"
#include "ui_change_profile.h"

Change_profile::Change_profile(Player& player,Client* client,QWidget *parent)
    : QMainWindow(parent)
    , ui(new Ui::Change_profile)
    player(player)
    ,client(client)
{
    ui->setupUi(this);

    //وقتی کاربر وارد این صفحه میشود باید از طریق ابجکت پلیر تمام فیلد ها متناسب با اون اتریبیوت پر بشوند بجز بخشی که مربوط به عوض
    //کردن رمز میباشد و تا وقتی که کاربر تغییری در فیلد ها نداده باشد دکمه ذخیره کردن تغییرات باید غیرفعال باشد
    //و وقتی کوچکترین تغییری در هر یک از فیلد ها داد  چک شود که فیلدی خالی نماند(فیلد های مربوط به تغییر رمز جداگانه بررسی شوند
    //در بخش مربوط به تغییر رمز اگر کاربر رمز فعلی رو وارد کرد باید معتبر بودنش چک بشود که حداقل ۸ رقم باشد و اگر  اوکی بود رمز جدید نیز بررسی شود که معتبر هست و از استفاده از رمز های ضعیف خودداری شود
    //درصورتی که کاربر شروط بالا را رعایت کرد دکمه ثبت تغییرات به حالت فعال در باید بیاید و وقتی این دکمه را زد باید چک شود که فرمت ایمیل و تلفن و
    // درست هست یا نه و اگر همه چیز اوکی بود در قالب زیر به سیرور پیام ارسال شود
    //  client.WriteToServer("C[CF][firstname][lastname][email][phone][username][password]")
    // پسوردی که ارسال میشود بدین گونه است که اگر کاربر نمیخواست رمز جدیدی داشته باشد همان رمز قبلی را وارد میکند و اگر رمز جدیدی وارد کرده بود باید رمز جدید را بفرستیم
    //باقی فیلد ها نیز از چیزی که کاربر در یو ای وارد کرده باید گرفته شود و ارسال شود
}



Change_profile::~Change_profile()
{
    delete ui;
}
